Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: That's it! All that remains is to build it; put the above code in a file called :file:`noddy.c` and ::
pl: To wszystko! Wszystko co pozostaje to zbudować to; umieść powyższy kod w pliku nazwanym :file:`noddy.c` i ::

source: in a file called :file:`setup.py`; then typing ::
pl: w pliku nazwanym :file:`setup.py`; potem wpisując ::

source: at a shell should produce a file :file:`noddy.so` in a subdirectory; move to that directory and fire up Python --- you should be able to ``import noddy`` and play around with Noddy objects.
pl: w powłoce, powinno to wyprodukować plik :file:`noddy.so` w podkatalogu; przejdź do tego katalogu i uruchom program interpretujący polecenia języka pytonowskiego --- powinieneś móc ``import noddy`` - importować noddy-ego i posługiwać się przedmiotami Noddy-ego.

source: That wasn't so hard, was it?
pl: To nie było takie trudne, nieprawdaż?

source: Of course, the current Noddy type is pretty uninteresting. It has no data and doesn't do anything. It can't even be subclassed.
pl: Oczywiście obecny typ uogólnienia Noddy nie jest zbyt interesujący. Nie ma w ogóle danych i nic nie robi. Nie może nawet być odziedziczony.

source: Adding data and methods to the Basic example
pl: Dodawanie danych i sposobów postępowania do podstawowego przykładu

source: Let's expend the basic example to add some data and methods. Let's also make the type usable as a base class. We'll create a new module, :mod:`noddy2` that adds these capabilities:
pl: Rozwińmy podstawowy przykład i dodajmy trochę danych i sposobów postępowania. Uczyńmy też typ używalnym jako uogólnienie bazowe. Stworzymy nowy moduł :mod:`noddy2`, który dodaje te możliwości:

source: #include <Python.h> #include "structmember.h" typedef struct { PyObject_HEAD PyObject *first; /* first name */ PyObject *last; /* last name */ int number; } Noddy; static void Noddy_dealloc(Noddy* self) { Py_XDECREF(self->first); Py_XDECREF(self->last); Py_TYPE(self)->tp_free((PyObject*)self); } static PyObject * Noddy_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { Noddy *self; self = (Noddy *)type->tp_alloc(type, 0); if (self != NULL) { self->first = PyUnicode_FromString(""); if (self->first == NULL) { Py_DECREF(self); return NULL; } self->last = PyUnicode_FromString(""); if (self->last == NULL) { Py_DECREF(self); return NULL; } self->number = 0; } return (PyObject *)self; } static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *first=NULL, *last=NULL, *tmp; static char *kwlist[] = {"first", "last", "number", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &first, &last, &self->number)) return -1; if (first) { tmp = self->first; Py_INCREF(first); self->first = first; Py_XDECREF(tmp); } if (last) { tmp = self->last; Py_INCREF(last); self->last = last; Py_XDECREF(tmp); } return 0; } static PyMemberDef Noddy_members[] = { {"first", T_OBJECT_EX, offsetof(Noddy, first), 0, "first name"}, {"last", T_OBJECT_EX, offsetof(Noddy, last), 0, "last name"}, {"number", T_INT, offsetof(Noddy, number), 0, "noddy number"}, {NULL} /* Sentinel */ }; static PyObject * Noddy_name(Noddy* self) { static PyObject *format = NULL; PyObject *args, *result; if (format == NULL) { format = PyUnicode_FromString("%s %s"); if (format == NULL) return NULL; } if (self->first == NULL) { PyErr_SetString(PyExc_AttributeError, "first"); return NULL; } if (self->last == NULL) { PyErr_SetString(PyExc_AttributeError, "last"); return NULL; } args = Py_BuildValue("OO", self->first, self->last); if (args == NULL) return NULL; result = PyUnicode_Format(format, args); Py_DECREF(args); return result; } static PyMethodDef Noddy_methods[] = { {"name", (PyCFunction)Noddy_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ }; static PyTypeObject NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(Noddy), /* tp_basicsize */ 0, /* tp_itemsize */ (destructor)Noddy_dealloc, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, /* tp_flags */ "Noddy objects", /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ Noddy_methods, /* tp_methods */ Noddy_members, /* tp_members */ 0, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ (initproc)Noddy_init, /* tp_init */ 0, /* tp_alloc */ Noddy_new, /* tp_new */ }; static PyModuleDef noddy2module = { PyModuleDef_HEAD_INIT, "noddy2", "Example module that creates an extension type.", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_noddy2(void) { PyObject* m; if (PyType_Ready(&NoddyType) < 0) return NULL; m = PyModule_Create(&noddy2module); if (m == NULL) return NULL; Py_INCREF(&NoddyType); PyModule_AddObject(m, "Noddy", (PyObject *)&NoddyType); return m; }
pl: #include <Python.h> #include "structmember.h" typedef struct { PyObject_HEAD PyObject *imie; /* Imię */ PyObject *nazwisko; /* nazwisko */ int numer; } Noddy; static void Noddy_dealloc(Noddy* self) { Py_XDECREF(self->imie); Py_XDECREF(self->nazwisko); Py_TYPE(self)->tp_free((PyObject*)self); } static PyObject * Noddy_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { Noddy *self; self = (Noddy *)type->tp_alloc(type, 0); if (self != NULL) { self->imie = PyUnicode_FromString(""); if (self->imie == NULL) { Py_DECREF(self); return NULL; } self->nazwisko = PyUnicode_FromString(""); if (self->nazwisko == NULL) { Py_DECREF(self); return NULL; } self->numer = 0; } return (PyObject *)self; } static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *first=NULL, *last=NULL, *tmp; static char *kwlist[] = {"imie", "nazwisko", "numer", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &imie, &nazwisko, &self->numer)) return -1; if (imie) { tmp = self->imie; Py_INCREF(imie); self->imie = imie; Py_XDECREF(tmp); } if (nazwisko) { tmp = self->nazwisko; Py_INCREF(nazwisko); self->nazwisko = nazwisko; Py_XDECREF(tmp); } return 0; } static PyMemberDef Noddy_members[] = { {"imie", T_OBJECT_EX, offsetof(Noddy, imie), 0, "imię"}, {"nazwisko", T_OBJECT_EX, offsetof(Noddy, nazwisko), 0, "nazwisko"}, {"numer", T_INT, offsetof(Noddy, numer), 0, "noddy numer"}, {NULL} /* Sentinel */ }; static PyObject * Noddy_name(Noddy* self) { static PyObject *format = NULL; PyObject *args, *result; if (format == NULL) { format = PyUnicode_FromString("%s %s"); if (format == NULL) return NULL; } if (self->imie == NULL) { PyErr_SetString(PyExc_AttributeError, "imie"); return NULL; } if (self->nazwisko == NULL) { PyErr_SetString(PyExc_AttributeError, "nazwisko"); return NULL; } args = Py_BuildValue("OO", self->imie, self->nazwisko); if (args == NULL) return NULL; result = PyUnicode_Format(format, args); Py_DECREF(args); return result; } static PyMethodDef Noddy_methods[] = { {"imie", (PyCFunction)Noddy_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ }; static PyTypeObject NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(Noddy), /* tp_basicsize */ 0, /* tp_itemsize */ (destructor)Noddy_dealloc, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, /* tp_flags */ "Noddy objects", /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ Noddy_methods, /* tp_methods */ Noddy_members, /* tp_members */ 0, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ (initproc)Noddy_init, /* tp_init */ 0, /* tp_alloc */ Noddy_new, /* tp_new */ }; static PyModuleDef noddy2module = { PyModuleDef_HEAD_INIT, "noddy2", "Przykładowy moduł który tworzy rozszerzający typ uogólnienia.", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_noddy2(void) { PyObject* m; if (PyType_Ready(&NoddyType) < 0) return NULL; m = PyModule_Create(&noddy2module); if (m == NULL) return NULL; Py_INCREF(&NoddyType); PyModule_AddObject(m, "Noddy", (PyObject *)&NoddyType); return m; }

source: This version of the module has a number of changes.
pl: Ta wersja modułu ma parę zmian.

source: We've added an extra include::
pl: Dodaliśmy dodatkową formułę załączenia - include::

source: This include provides declarations that we use to handle attributes, as described a bit later.
pl: Ta dyrektywa załączania (include) dostarcza deklaracje których używamy do obsługi własności jak opisano kawałek później.

source: The name of the :class:`Noddy` object structure has been shortened to :class:`Noddy`. The type object name has been shortened to :class:`NoddyType`.
pl: Nazwa struktury przedmiotu :class:`Noddy` została skrócona do :class:`Noddy`. Nazwa przedmiotu typu została skrócona do :class:`NoddyType`.

source: The :class:`Noddy` type now has three data attributes, *first*, *last*, and *number*. The *first* and *last* variables are Python strings containing first and last names. The *number* attribute is an integer.
pl: Typ uogólnienia teraz ma trzy własności danych, *imie*, *nazwisko* i *numer*. Zmienne *imie* i *nazwisko* są ciągami znaków języka pytonowskiego zawierającymi imię i nazwisko. Własność *numer* jest liczbą całkowitą.

source: The object structure is updated accordingly::
pl: Struktura przedmiotu jest uaktualniona podobnie::

source: typedef struct { PyObject_HEAD PyObject *first; PyObject *last; int number; } Noddy;
pl: typedef struct { PyObject_HEAD PyObject *imie; PyObject *nazwisko; int numer; } Noddy;

source: Because we now have data to manage, we have to be more careful about object allocation and deallocation. At a minimum, we need a deallocation method::
pl: Ponieważ teraz mamy dane do zarządzania, musimy być bardziej ostrożni w kwestii umieszczania w pamięci i odbierania miejsca. Jako minimum, potrzebujemy sposobu zwalniania miejsca w pamięci::

source: static void Noddy_dealloc(Noddy* self) { Py_XDECREF(self->first); Py_XDECREF(self->last); Py_TYPE(self)->tp_free((PyObject*)self); }
pl: static void Noddy_dealloc(Noddy* self) { Py_XDECREF(self->imie); Py_XDECREF(self->nazwisko); Py_TYPE(self)->tp_free((PyObject*)self); }

source: which is assigned to the :attr:`tp_dealloc` member::
pl: które jest przypisany do członka :attr:`tp_dealloc`::

source: This method decrements the reference counts of the two Python attributes. We use :cfunc:`Py_XDECREF` here because the :attr:`first` and :attr:`last` members could be *NULL*. It then calls the :attr:`tp_free` member of the object's type to free the object's memory. Note that the object's type might not be :class:`NoddyType`, because the object may be an instance of a subclass.
pl: Ten sposób postępowania zmniejsza liczbę odniesień do dwóch własności języka pytonowskiego. Używamy :cfunc:`Py_XDECREF` tutaj ponieważ :attr:`imie` i :attr:`nazwisko` mogą być *NULL*. Potem uruchamia członka :attr:`tp_free` typu przedmiotu aby zwolnić pamięć przedmiotu. Zauważ, że typ przedmiotu może nie być :class:`NoddyType`, ponieważ przedmiot może być przykładem podrzędnego uogólnienia.

source: We want to make sure that the first and last names are initialized to empty strings, so we provide a new method::
pl: Chcemy upewnić się że imię i nazwisko są zainicjowane do pustych ciągów znaków, więc dostarczamy sposób postępowania nowości::

source: static PyObject * Noddy_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { Noddy *self; self = (Noddy *)type->tp_alloc(type, 0); if (self != NULL) { self->first = PyString_FromString(""); if (self->first == NULL) { Py_DECREF(self); return NULL; } self->last = PyString_FromString(""); if (self->last == NULL) { Py_DECREF(self); return NULL; } self->number = 0; } return (PyObject *)self; }
pl: static PyObject * Noddy_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { Noddy *self; self = (Noddy *)type->tp_alloc(type, 0); if (self != NULL) { self->imie = PyString_FromString(""); if (self->imie == NULL) { Py_DECREF(self); return NULL; } self->nazwisko = PyString_FromString(""); if (self->nazwisko == NULL) { Py_DECREF(self); return NULL; } self->numer = 0; } return (PyObject *)self; }

source: and install it in the :attr:`tp_new` member::
pl: i zainstaluj go w elemencie :attr:`tp_new`::

source: The new member is responsible for creating (as opposed to initializing) objects of the type. It is exposed in Python as the :meth:`__new__` method. See the paper titled "Unifying types and classes in Python" for a detailed discussion of the :meth:`__new__` method. One reason to implement a new method is to assure the initial values of instance variables. In this case, we use the new method to make sure that the initial values of the members :attr:`first` and :attr:`last` are not *NULL*. If we didn't care whether the initial values were *NULL*, we could have used :cfunc:`PyType_GenericNew` as our new method, as we did before. :cfunc:`PyType_GenericNew` initializes all of the instance variable members to *NULL*.
pl: członek new jest odpowiedzialny za tworzenie (w przeciwieństwie do inicjowania) przedmiotów o określonym typie. Jest wystawiony w języku pytonowskim jako sposób postępowania :meth:`__new__`. Zobacz dokument "Unifikacja typów i uogólnień w języku pytonowskim" dla pogłębionej dyskusji o sposobie postępowania :meth:`__new__`. Jednym z powodów do wypełnienia sposobu postępowania "nowy" - z ang. - new jest zapewnienie wartości początkowych zmiennych przykładu. W tym przypadku, używamy sposobu postępowania "new" aby zapewnić, że wartości początkowe członków :attr:`first` i :attr:`last` nie są puste (*NULL*). Jeśli nie troszczylibyśmy się, czy początkowe wartości były *NULL*, moglibyśmy użyć :cfunc:`PyType_GenericNew` jako naszego sposobu postępowania "new", tak jak poprzednio. :cfunc:`PyType_GenericNew` inicjuje wszystkie członki zmienne przykładu na *NULL*.

source: The new method is a static method that is passed the type being instantiated and any arguments passed when the type was called, and that returns the new object created. New methods always accept positional and keyword arguments, but they often ignore the arguments, leaving the argument handling to initializer methods. Note that if the type supports subclassing, the type passed may not be the type being defined. The new method calls the tp_alloc slot to allocate memory. We don't fill the :attr:`tp_alloc` slot ourselves. Rather :cfunc:`PyType_Ready` fills it for us by inheriting it from our base class, which is :class:`object` by default. Most types use the default allocation.
pl: Sposób postępowania "new" jest sposobem postępowania statycznym, któremu przekazywany jest typ uogólnienia którego przykład dajemy i jakiekolwiek parametry przekazywane gdy typ został wywołany, i który zwraca nowo utworzony przedmiot. Metoda "Nowy" - z ang. - "new" zawsze akceptuje parametry pozycyjne i słów kluczowych, ale często pomija parametry, pozostawiając obsługę parametrów dla sposobów postępowania inicjujących. Zauważ, że jeśli typ wspiera tworzenie uogólnień podrzędnych, przekazywany typ nie może być typem który jest definiowany. Sposób postępowania "nowy" - z ang. - "new" wzywa gniazdo tp_alloc aby alokować pamięć. Nie wypełniamy własnoręcznie :attr:`tp_alloc`. Raczej :cfunc:`PyType_Ready` wypełnia go za nas przez odziedziczenie go z naszego bazowego uogólnienia, którym jest :class:`object` - z ang. - przedmiot domyślnie. Większość typów używa domyślnego przydzielania pamięci.

source: If you are creating a co-operative :attr:`tp_new` (one that calls a base type's :attr:`tp_new` or :meth:`__new__`), you must *not* try to determine what method to call using method resolution order at runtime. Always statically determine what type you are going to call, and call its :attr:`tp_new` directly, or via ``type->tp_base->tp_new``. If you do not do this, Python subclasses of your type that also inherit from other Python-defined classes may not work correctly. (Specifically, you may not be able to create instances of such subclasses without getting a :exc:`TypeError`.)
pl: Jeśli tworzysz ko-operujący :attr:`tp_new` (taki, który wywołuje sposób postępowania :attr:`tp_new` lub :meth:`__new__` typu bazowego), *nie* możesz próbować określić którą metodę wywołać przy użyciu ustalania kolejności sposobów postępowania w czasie wykonania. Zawsze określaj statycznie do którego typu będziesz się odwoływał, i wzywaj jego :attr:`tp_new` bezpośrednio, lub przez ``type->tp_base->tp_new``. Jeśli tego nie zrobisz, podrzędne uogólnienia języka pytonowskiego twojego typu, który także dziedziczy po innych określonych przez język pytonowski uogólnieniach może nie działać prawidłowo. (Szczególnie, być może nie będziesz mógł tworzyć przykładów takich podrzędnych uogólnień bez otrzymania sytuacji wyjątkowej :exc:`TypeError`.)

source: We provide an initialization function::
pl: Dostarczamy zadanie inicjujące::

source: static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *first=NULL, *last=NULL, *tmp; static char *kwlist[] = {"first", "last", "number", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &first, &last, &self->number)) return -1; if (first) { tmp = self->first; Py_INCREF(first); self->first = first; Py_XDECREF(tmp); } if (last) { tmp = self->last; Py_INCREF(last); self->last = last; Py_XDECREF(tmp); } return 0; }
pl: static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *imie=NULL, *nazwisko=NULL, *tmp; static char *kwlist[] = {"imie", "nazwisko", "numer", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &imie, &nazwisko, &self->numer)) return -1; if (imie) { tmp = self->imie; Py_INCREF(imie); self->imie = imie; Py_XDECREF(tmp); } if (nazwisko) { tmp = self->nazwisko; Py_INCREF(nazwisko); self->nazwisko = nazwisko; Py_XDECREF(tmp); } return 0; }

source: by filling the :attr:`tp_init` slot. ::
pl: przez wypełnienie gniazda :attr:`tp_init`. ::

source: The :attr:`tp_init` slot is exposed in Python as the :meth:`__init__` method. It is used to initialize an object after it's created. Unlike the new method, we can't guarantee that the initializer is called. The initializer isn't called when unpickling objects and it can be overridden. Our initializer accepts arguments to provide initial values for our instance. Initializers always accept positional and keyword arguments.
pl: Gniazdo :attr:`tp_init` jest wystawione w języku pytonowskim jako sposób postępowania :meth:`__init__`. Jest używany do inicjowania przedmiotu po jego utworzeniu. W przeciwieństwie do sposobu postępowania "nowy", nie możemy zagwarantować że sposób postępowania inicjujący będzie uruchomiony. Sposób postępowania inicjujący nie jest uruchamiany gdy przedmiot jest odpakowywany i może być zastąpiony. Sposób postępowania inicjujący akceptuje parametry aby dostarczyć wartości początkowych dla naszego przykładu. Sposoby postępowania inicjujące zawsze akceptują parametry pozycyjne i słów kluczowych.

source: Initializers can be called multiple times. Anyone can call the :meth:`__init__` method on our objects. For this reason, we have to be extra careful when assigning the new values. We might be tempted, for example to assign the :attr:`first` member like this::
pl: Sposoby postępowania inicjujące mogą być wzywane kilkukrotnie. Ktokolwiek może wezwać :meth:`__init__` na naszych przedmiotach. Z tego powodu, musimy być szczególnie ostrożni gdy przypisujemy nowe wartości. Możemy pokusić się, dla przykładu na przypisanie członka :attr:`imie` jak następuje::

source: if (first) { Py_XDECREF(self->first); Py_INCREF(first); self->first = first; }
pl: if (imie) { Py_XDECREF(self->imie); Py_INCREF(imie); self->imie = imie; }

source: But this would be risky. Our type doesn't restrict the type of the :attr:`first` member, so it could be any kind of object. It could have a destructor that causes code to be executed that tries to access the :attr:`first` member. To be paranoid and protect ourselves against this possibility, we almost always reassign members before decrementing their reference counts. When don't we have to do this?
pl: Ale to byłoby ryzykowne. Nasz typ nie ogranicza typu członka :attr:`imie`, więc może być jakiegokolwiek rodzaju przedmiotem. Może mieć destruktor, który powoduje że kod uruchamiany próbuje uzyskać dostęp do członka :attr:`imie`. Aby być paranoikami i bronić się przed tą możliwością, prawie zawsze przepisujemy członki przed zmniejszeniem ich liczby odniesień. Kiedy nie musimy tego robić?

source: when we absolutely know that the reference count is greater than 1
pl: gdy absolutnie wiemy że liczba odniesień jest większa niż 1

source: when we know that deallocation of the object [#]_ will not cause any calls back into our type's code
pl: gdy wiemy że zabranie miejsca w pamięci na przedmiot [#]_ nie spowoduje żadnych powrotnych wywołań do kodu naszego typu

source: when decrementing a reference count in a :attr:`tp_dealloc` handler when garbage-collections is not supported [#]_
pl: gdy zmniejszajamy liczbę odniesień w obsłudze :attr:`tp_dealloc` gdy zbiórka-śmieci nie jest dostępna [#]_

source: We want to expose our instance variables as attributes. There are a number of ways to do that. The simplest way is to define member definitions::
pl: Chcemy wystawić zmienne naszego przykładu jako własności. Istnieje kilka dróg do tego. Najprościej jest zdefiniować definicje członków::

source: static PyMemberDef Noddy_members[] = { {"first", T_OBJECT_EX, offsetof(Noddy, first), 0, "first name"}, {"last", T_OBJECT_EX, offsetof(Noddy, last), 0, "last name"}, {"number", T_INT, offsetof(Noddy, number), 0, "noddy number"}, {NULL} /* Sentinel */ };
pl: static PyMemberDef Noddy_members[] = { {"imie", T_OBJECT_EX, offsetof(Noddy, imie), 0, "imię"}, {"nazwisko", T_OBJECT_EX, offsetof(Noddy, nazwisko), 0, "nazwisko"}, {"numer", T_INT, offsetof(Noddy, numer), 0, "numer noddy-ego"}, {NULL} /* Ochrona */ };

source: and put the definitions in the :attr:`tp_members` slot::
pl: i wstawić definicje do gniazda :attr:`tp_members`::

source: Each member definition has a member name, type, offset, access flags and documentation string. See the :ref:`Generic-Attribute-Management` section below for details.
pl: Każda definicja członka ma nazwę członka, rodzaj, odstęp w pamięci, flagi dostępu i ciąg dokumentacji. Zobacz sekcję :ref:`Zarządzanie-zamiennymi-własnościami` - z ang. - :ref:`Generic-Attribute-Management` po więcej szczegółów na ten temat.
